src/cf/src/InformationRegisters/ТелеграмНастройкиПользователей/ТелеграмНастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмНастройкиПользователей</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ПраваДоступа</name>
    <type>
      <types>EnumRef.ТипыПользователейЗадач</types>
    </type>
  </resources>
  <dimensions>
    <name>Бот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЧата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ТелеграмНастройкиПользователей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСоставНастроек() Экспорт
	
	// Добавляйте сюда необходимые Вам ресурсы
	СоставНастроек = Новый Структура;
	СоставНастроек.Вставить("Пользователь", "Пользователь");
	СоставНастроек.Вставить("ПраваДоступа", "ПраваДоступа");
	Возврат СоставНастроек;
	
КонецФункции

Функция ПолучитьНастройкиПользователя(Бот, ИдентификаторЧата) Экспорт
	
	НастройкиПользователя = Новый Структура;
	
	СоставНастроек = ПолучитьСоставНастроек();
	Если ИдентификаторЧата = Неопределено Тогда
		Для Каждого КлючИЗначение Из СоставНастроек Цикл
			НастройкиПользователя.Вставить(КлючИЗначение.Значение, Неопределено);
			Возврат НастройкиПользователя;
		КонецЦикла;
	КонецЕсли;
	
	// Сборка текста запроса
	ТекстЗапроса = "";
	Для Каждого КлючИЗначение Из СоставНастроек Цикл
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса + "," + Символы.ПС;
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "Р." + КлючИЗначение.Ключ + " КАК " + КлючИЗначение.Значение;
	КонецЦикла;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|" + ТекстЗапроса + "
	|ИЗ РегистрСведений.ТелеграмНастройкиПользователей КАК Р
	|ГДЕ Р.Бот = &Бот И Р.ИдентификаторЧата = &ИдентификаторЧата";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("ИдентификаторЧата", ИдентификаторЧата);
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Для Каждого КлючИЗначение Из СоставНастроек Цикл
			НастройкиПользователя.Вставить(КлючИЗначение.Значение, Неопределено);
		КонецЦикла;
		Возврат НастройкиПользователя;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Для Каждого КлючИЗначение Из СоставНастроек Цикл
			НастройкиПользователя.Вставить(КлючИЗначение.Значение, Выборка[КлючИЗначение.Ключ]);
		КонецЦикла;
	КонецЕсли;
	
	Возврат НастройкиПользователя;
	
КонецФункции

#КонецОбласти

#КонецЕсли
